'use strict';

// 1. Напишіть код який виводить в консоль значення від 1 до 100, але замість чисел кратних 3 має виводитись `Лол`, замість значень кратних 5 - `Кек`, а замість значень кратних і 3, і 5 - `ЛолКек`

for (let i = 1; i <= 100; i++) {
  if (i % 3 === 0 && i % 5 === 0) {
    console.log('ЛолКек');
  } else if (i % 3 === 0) {
    console.log('Лол');
  } else if (i % 5 === 0) {
    console.log('Кек');
  } else {
    console.log(i);
  }
}

console.log('------------------------------------------------------');

//2. Напишіть код який бере значення зі змінної (`value`) і виводить у консоль всі парні числа, що менші за задане. Наприклад, якщо у змінній число 10, програма має вивести наступне: 2, 4, 6, 8. Додаткові вимоги:
// 1) Реалізуйте рішення 2 способами: з використанням циклу `for` та `while`
// 2) Код має перевіряти, чи значення у змінній є числом. Якщо воно не є числом, в консоль має вивестись повідомлення про помилку, наприклад `'Таке чуство шо Бог десь наказує нас за шось'`.

let value = 10;
// let value = '10' ---> Данні для перевірки
// let value = null; ---> Данні для перевірки

// Перевірка типу даних
if (typeof value !== 'number') {
  console.error(`'Таке чуство шо Бог десь наказує нас за шось'`);
} else {
  // З використанням циклу `for`
  for (let i = 1; i < value; i++) {
    if (i % 2 === 0) {
      console.log(i);
    }
  }
}

console.log('------------------------------------------------------');

let i = 1;
// Перевірка типу даних
if (typeof value !== 'number') {
  console.error(`'Таке чуство шо Бог десь наказує нас за шось'`);
} else {
  // З використанням циклу `while`
  while (i < value) {
    if (i % 2 === 0) {
      console.log(i);
    }
    i++;
  }
}

console.log('------------------------------------------------------');
